In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'Name':['Ali','Ahsan','Hamza','Umer','Ali']
                , 'Marks':[34,45,np.nan,np.nan,50]
                 , 'Age': (np.random.randint(10,25,size=[5]))})

np.random.seed(5)

In [3]:
df

    Name  Marks  Age
0    Ali   34.0   20
1  Ahsan   45.0   23
2  Hamza    NaN   12
3   Umer    NaN   18
4    Ali   50.0   11

In [7]:
df.Age.iloc[3]=np.nan

In [8]:
df.Age.iloc[1]=np.nan

In [9]:
df

    Name  Marks   Age
0    Ali   34.0  20.0
1  Ahsan   45.0   NaN
2  Hamza    NaN  12.0
3   Umer    NaN   NaN
4    Ali   50.0  11.0

In [10]:
df.Age.fillna(method='ffill',inplace=True) #inplace is used for changing in data

In [11]:
df

    Name  Marks   Age
0    Ali   34.0  20.0
1  Ahsan   45.0  20.0
2  Hamza    NaN  12.0
3   Umer    NaN  12.0
4    Ali   50.0  11.0

In [12]:
df.duplicated(['Age'])

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [13]:
df.duplicated(['Name'])

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [14]:
df.drop_duplicates(['Age'])

    Name  Marks   Age
0    Ali   34.0  20.0
2  Hamza    NaN  12.0
4    Ali   50.0  11.0

In [15]:
df.drop_duplicates(['Name'])

    Name  Marks   Age
0    Ali   34.0  20.0
1  Ahsan   45.0  20.0
2  Hamza    NaN  12.0
3   Umer    NaN  12.0

In [16]:
#del df['Age'] usable function

In [19]:
df.drop_duplicates(['Name'],keep='last') #keep last means it will display last and drop the first one

    Name  Marks   Age
1  Ahsan   45.0  20.0
2  Hamza    NaN  12.0
3   Umer    NaN  12.0
4    Ali   50.0  11.0

In [20]:
df

    Name  Marks   Age
0    Ali   34.0  20.0
1  Ahsan   45.0  20.0
2  Hamza    NaN  12.0
3   Umer    NaN  12.0
4    Ali   50.0  11.0

In [28]:
name_to_lname = {'Ali':'Raza','Ahsan':'Moiz','Hamza':'Khan',\
                'Umer':'Najeeb'}

In [29]:
df['father_Name']=df.Name.map(name_to_lname)

In [30]:
df

    Name  Marks   Age father_Name
0    Ali   34.0  20.0        Raza
1  Ahsan   45.0  20.0        Moiz
2  Hamza    NaN  12.0        Khan
3   Umer    NaN  12.0      Najeeb
4    Ali   50.0  11.0        Raza

In [40]:
#map applies on series 
#apply works on whole Data Frame

In [52]:
df=pd.DataFrame({'Name':['Ali','Ahsan','Hamza','Umer','Ali']
                , 'Marks':(np.random.randint(50,90,size=[5]))
                , 'Age':(np.random.randint(10,25,size=[5]))})

np.random.seed(5)

In [53]:
df['Result'] =df['Marks'] \
                        .apply( lambda x:'Pass' if x>70 else 'Fail')

In [54]:
df

    Name  Marks  Age Result
0    Ali     85   18   Pass
1  Ahsan     64   14   Fail
2  Hamza     88   17   Pass
3   Umer     66   24   Fail
4    Ali     59   21   Fail

In [55]:
df.replace({'Ali':'Taha'}, inplace = True)
df

    Name  Marks  Age Result
0   Taha     85   18   Pass
1  Ahsan     64   14   Fail
2  Hamza     88   17   Pass
3   Umer     66   24   Fail
4   Taha     59   21   Fail

In [56]:
df.index = df.index.map(lambda i: 'Student'+str(i))

In [60]:
df

           Name  Marks  Age Result
Student0   Taha     85   18   Pass
Student1  Ahsan     64   14   Fail
Student2  Hamza     88   17   Pass
Student3   Umer     66   24   Fail
Student4   Taha     59   21   Fail

In [64]:
df.index=['Student'+str(x) for x in range(5)] #same work is done as above

In [66]:
df

           Name  Marks  Age Result
Student0   Taha     85   18   Pass
Student1  Ahsan     64   14   Fail
Student2  Hamza     88   17   Pass
Student3   Umer     66   24   Fail
Student4   Taha     59   21   Fail